In [2]:
!pip install update 
!pip install pandas

Requirement already satisfied: update in /Users/jaeyeopchung/opt/anaconda3/lib/python3.7/site-packages (0.0.1)
Requirement already satisfied: style==1.1.0 in /Users/jaeyeopchung/opt/anaconda3/lib/python3.7/site-packages (from update) (1.1.0)
Requirement already satisfied: pandas in /Users/jaeyeopchung/opt/anaconda3/lib/python3.7/site-packages (1.0.5)
Requirement already satisfied: numpy>=1.13.3 in /Users/jaeyeopchung/opt/anaconda3/lib/python3.7/site-packages (from pandas) (1.19.0)
Requirement already satisfied: pytz>=2017.2 in /Users/jaeyeopchung/opt/anaconda3/lib/python3.7/site-packages (from pandas) (2019.3)
Requirement already satisfied: python-dateutil>=2.6.1 in /Users/jaeyeopchung/opt/anaconda3/lib/python3.7/site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in /Users/jaeyeopchung/opt/anaconda3/lib/python3.7/site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)

In [3]:
import numpy as np
import pandas as pd

# 1. 데이터프레임 : 인덱싱 접근 
- 열
    - 열 1개 선택(시리즈 생성)
        - DataFrame 객체["열 이름"]
        - DataFrame 객체.열 이름
    - 열 n개 선택( 데이터 프레임 생성 ) 
        - DataFrame 객체[ [ 열1, 열2 , ... , 열n ] ]

- 행  
    - 범위 지정 : df.loc[ 슬라이싱 ]
    - 범위 지정 df.iloc [ 시작 인덱스 : 끝 인덱스 : 슬라이싱 간격 ]
        - 데이터프레임
    - 특정 대상 지정 : df.loc[ 인덱스, 컬럼명 ]
    - 특정 대상 지정 df.iloc[ 정수 인덱스, 열 인덱스 ]
        - 원소

- 원소 선택
    - 인덱스 이름 접근 ( df.loc ) 
        - DataFrame 객체.loc[ 행인덱스,열이름 ]
    - 정수 위치 인덱스 ( df.iloc ) 
        - DataFrame 객체.iloc[ 행번호,열번호 ]

- 여러 열/행 선택
    - 각 원소 타입 반환
        - 행 1개, 열 1개
    - 시리즈 객체 반환 ( n = 2 이상 )
        - 행 1개 / 열 n개 
        - 행 n개 / 열 1개
    - 데이터 프레임 객체 반환 ( n = 2 이상 )
        - 행 n개 / 열 n개   
            - ➤ df.loc[[ 행 인덱스1, 행 인덱스2.. ]][ 컬럼 ]
            - ➤ df.loc[[ 행 인덱스1, 행 인덱스2.. ]][[ 컬럼1, 컬럼2 .. ]]
            - ➤ df.loc[ 행 인덱스 ][[ 컬럼1, 컬럼2 .. ]] 
            - ➤ df.loc[ 행 인덱스 ][ 컬럼 ]

- df.setindex('컬럼명') : 해당 컬럼을 인덱스 열로 지정

###### default setting

In [4]:
data = {'state': ['Colorado', 'Utah', 'Ohio', 'Arizona', 'Nevada', 'Wyoming'], 
        'year': [2000, 2001, 2002, 2001, 2002, 2001],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 1.7]}
df = pd.DataFrame(data)
df.index = ['one', 'two', 'three', 'four', 'five', 'six']
df

          state  year  pop
one    Colorado  2000  1.5
two        Utah  2001  1.7
three      Ohio  2002  3.6
four    Arizona  2001  2.4
five     Nevada  2002  2.9
six     Wyoming  2001  1.7

___

## 1.1 행 선택 - df.loc 과 iloc 
<img src = '../images/loc_iloc.jpg' height = '70%' width = '70%' align = 'left' >

In [5]:
pwd

'/Users/jaeyeopchung/jupyter_notebook/MachineLearning/공부자료'

###### 특정 대상 지정 df.loc[ 인덱스, 컬럼명 ]

In [6]:
df5 = df

In [7]:
df5.loc['one', 'year']

2000

###### 범위 지정 df.iloc[ 정수 슬라이싱 ]

In [8]:
df.iloc[0:2]

        state  year  pop
one  Colorado  2000  1.5
two      Utah  2001  1.7

###### 특정 대상 지정 df.iloc[ 정수 인덱스, 열 인덱스 ]

In [9]:
df.iloc[0, 1]

2000

###### 범위지정 df.loc[ 슬라이싱 ]

In [10]:
df4 = df 
df4.loc['one':'two']

        state  year  pop
one  Colorado  2000  1.5
two      Utah  2001  1.7

###### 범위 지정 df.iloc [ 시작 인덱스 : 끝 인덱스 : 슬라이싱 간격 ]

In [11]:
df.iloc[0:6:2]

          state  year  pop
one    Colorado  2000  1.5
three      Ohio  2002  3.6
five     Nevada  2002  2.9

In [12]:
df.iloc[0:3, [0,1]]

          state  year
one    Colorado  2000
two        Utah  2001
three      Ohio  2002

###### iloc 참고  
- iloc 사용 시
    - df.iloc[ 행1:행n, [열1, 열2..]]    ➤ ( O )
    - df.iloc[ 행1:행n ][[ 열1, 열2..]]  ➤ ( X )

In [13]:
df.iloc[0:2][[0,1]] # Error

KeyError: "None of [Int64Index([0, 1], dtype='int64')] are in the [columns]"

___

## 1.2. 열 선택  - 행/열 여러개 선택 시 대괄호 2개 ➤ 데이터프레임 반환

- 열 1개 선택 ➤ (시리즈 생성)
    - DataFrame 객체["열 이름"]
    - DataFrame 객체.열 이름

- 열 n개 선택 ➤ (데이터 프레임 생성) 
    - DataFrame 객체[ [ 열1, 열2 , ... , 열n ] ]

In [ ]:
df['state']

In [ ]:
df[ ['state', 'year', 'pop'] ]

## 1.4. 원소 선택

- 인덱스 이름 접근 ( df.loc ) 
    - DataFrame 객체.loc[ 행인덱스,열이름 ]
- 정수 위치 인덱스 ( df.iloc ) 
    - DataFrame 객체.iloc[ 행번호,열번호 ]

- 각 원소 타입 반환
    - 행 1개, 열 1개
- 시리즈 객체 반환 ( n = 2 이상 )
    - 행 1개 / 열 n개 
    - 행 n개 / 열 1개
- 데이터 프레임 객체 반환 ( n = 2 이상 )
    - 행 n개 / 열 n개   
        - ➤ df.loc[[ 행 인덱스1, 행 인덱스2.. ]][ 컬럼 ]
        - ➤ df.loc[[ 행 인덱스1, 행 인덱스2.. ]][[ 컬럼1, 컬럼2 .. ]]
        - ➤ df.loc[ 행 인덱스 ][[ 컬럼1, 컬럼2 .. ]] 
        - ➤ df.loc[ 행 인덱스 ][ 컬럼 ]
        - ➤ df.iloc[ 행 슬라이스, [ 인덱스1, 인덱스2 .. ]
        - ➤ df.iloc[ 행 슬라이스, 컬럼 슬라이스 ]
            - df.iloc[ 행 슬라이스, [ 컬럼 슬라이스 ] ] # Error!!

- df.setindex('컬럼명') : 해당 컬럼을 인덱스 열로 지정

<img src = '../images/원소선택.jpg' height = '70%' width = '70%' align = 'left' >

In [ ]:
exam_data = { '이름' : [ '서준', '우현', '인아'],
              '수학' : [ 90, 80, 70], 
              '영어' : [ 98, 89, 95], 
              '음악' : [ 85, 95, 100], 
              '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

In [ ]:
df.set_index('이름', inplace = True)
df

###### 특정 원소 선택  : 해당 원소 타입 반환

In [ ]:
df.loc['서준', '음악'] # type : numpy.int64

In [ ]:
df.iloc[0,2]         # type : numpy.int64

###### 행 1개, 열 n개 / 행 n개, 열 1개  : 시리즈 반환

In [ ]:
df.loc['서준', ['음악', '체육']]

In [ ]:
df.loc['서준'][['음악', '체육']]

In [ ]:
df.loc[['서준', '우현'], '체육']

In [ ]:
df.loc[['서준', '우현']]['체육']

###### 행2개, 열2개 이상 : 데이터 프레임 반환

In [ ]:
df.loc['서준':'우현', '수학':'영어']

In [ ]:
df.loc[:,['음악','체육']]

In [ ]:
df.iloc[:, [2, 3]]

# 2. 데이터프레임 인덱싱 : 행/열 추가

###### default setting

In [14]:
exam_data = { '이름' : [ '서준', '우현', '인아'],
              '수학' : [ 90, 80, 70], 
              '영어' : [ 98, 89, 95], 
              '음악' : [ 85, 95, 100], 
              '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

## 2.1. 열 추가 
-  DataFrame 객체[ '추가하려는 열 이름' ] = 데이터 값

In [15]:
df['국어'] = 80
df

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80

## 2.2. 행 추가
- DataFrame.loc[ '새로운 행 이름' ] = 데이터 값 (또는 배열)

In [16]:
df.loc[3] = 0

In [17]:
df

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80
3   0   0   0    0    0   0

In [18]:
df.loc[4] = ['재엽', 100, 100, 100, 100, 100]
df

   이름   수학   영어   음악   체육   국어
0  서준   90   98   85  100   80
1  우현   80   89   95   90   80
2  인아   70   95  100   90   80
3   0    0    0    0    0    0
4  재엽  100  100  100  100  100

# 3. 원소 값 변경

###### 이름을 인덱스 이름으로 변경

In [19]:
df.set_index('이름', inplace=True)
df

     수학   영어   음악   체육   국어
이름
서준   90   98   85  100   80
우현   80   89   95   90   80
인아   70   95  100   90   80
0     0    0    0    0    0
재엽  100  100  100  100  100

In [20]:
df.loc['서준']['수학':'국어'] = 10
df

     수학   영어   음악   체육   국어
이름
서준   10   10   10   10   10
우현   80   89   95   90   80
인아   70   95  100   90   80
0     0    0    0    0    0
재엽  100  100  100  100  100

In [21]:
df.loc['서준', ['음악', '체육']][0]

10

In [22]:
df.loc['서준', ['음악', '체육']][1]

10

In [23]:
df.loc['서준'][['음악','체육']]

음악    10
체육    10
Name: 서준, dtype: int64

# 4. 행, 열 위치 바꾸기 : Transpose, 전치 연산

 
- DataFrame 객체.transpose() 
- DataFrame 객체.T  
<img src = '../images/transpose.jpg' height = '60%' width = '60%' align = 'left'>

###### default setting

In [24]:
exam_data = { '이름' : [ '서준', '우현', '인아'],
              '수학' : [ 90, 80, 70], 
              '영어' : [ 98, 89, 95], 
              '음악' : [ 85, 95, 100], 
              '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

###### df.transpose

In [25]:
df = df.transpose()
df

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

# 5. 특정 열을 행 인덱스로 설정

- DataFrame 객체.set_index( [ '열 이름' ] 또는 '열 이름')
    - 옵션 : inplace = True / False

###### default setting

In [26]:
exam_data = { '이름' : [ '서준', '우현', '인아'],
              '수학' : [ 90, 80, 70], 
              '영어' : [ 98, 89, 95], 
              '음악' : [ 85, 95, 100], 
              '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [27]:
df.set_index('이름')

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

# 6. 인덱스 재배열 
- DataFrame 객체.index = 새로운 인덱스 배열

 
- DataFrame 객체.reindex( 새로운 인덱스 배열 ) ➤ 새롭게 입력되는 인덱스에 기본값 주기 위함 
    - __옵션 : fillvalue = None__
    - __새로운 데이터프레임 배열 반환__

- 기존 데이터프레임에 존재하지 않는 행 인덱스가 새롭게 추가되는 경우 __그 행의 데이터 값은 NaN 값이 입력__

###### default setting

In [28]:
dict_data = {'c0':[1,2,3], 
             'c1':[4,5,6], 
             'c2':[7,8,9], 
             'c3':[10,11,12], 
             'c4':[13,14,15]}
df = pd.DataFrame(dict_data, index = ['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

###### 새로운 인덱스 r3, r4 추가 ➤ Nan 값이 입력됨

In [29]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
df2.index = new_index
df2

NameError: name 'df2' is not defined

In [30]:
df2 = df.reindex(new_index)
df2

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [31]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
df2 = df.reindex(new_index, fill_value = 0)
df2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

# 7. 인덱스 초기화 
- DataFrame 객체.reset_index()
    - 기존 행 인덱스는 열로 이동
    - __새로운 데이터프레임 객체 반환__

###### default setting

In [32]:
dict_data = {'c0':[1,2,3], 
             'c1':[4,5,6], 
             'c2':[7,8,9], 
             'c3':[10,11,12], 
             'c4':[13,14,15]}
df = pd.DataFrame(dict_data, index = ['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [33]:
ndf = df.reset_index()
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

# 8. 행 인덱스를 기준으로 데이터프레임 정렬 : sort_index()

- DataFrame 객체.sort_index( ascending = True, inplace = False )
    - 기본값 : 오름차순 ( True )

###### default setting

In [34]:
dict_data = {'c0':[1,2,3], 
             'c1':[4,5,6], 
             'c2':[7,8,9], 
             'c3':[10,11,12], 
             'c4':[13,14,15]}
df = pd.DataFrame(dict_data, index = ['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [35]:
df.sort_index(ascending = False)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

# 9. 특정 열의 데이터 값을 기준으로 데이터프레임 정렬 : sort_values()
- DataFrame 객체.sort_values(by = '기준열', ascending = True)
    - 반환값 : 데이터프레임

###### default setting

In [36]:
dict_data = {'c0':[10,1,3], 
             'c1':[20,45,6], 
             'c2':[30,80,9], 
             'c3':[40,70,12], 
             'c4':[50,60,15]}
df = pd.DataFrame(dict_data, index = ['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0  10  20  30  40  50
r1   1  45  80  70  60
r2   3   6   9  12  15

###### c1열 오름차순으로 데이터 프레임 정렬

In [37]:
df.sort_values(by = 'c1', ascending = True)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r0  10  20  30  40  50
r1   1  45  80  70  60

###### 2개 이상의 컬럼을 기준으로 데이터 프레임 정렬 
- 기준이 되는 컬럼들의 가장 첫 번째 컬럼 정렬, 두 번째 컬럼 정렬 ...순으로 정렬
    - ex) c0 정렬, c1 정렬 ..

In [38]:
df.sort_values(['c0', 'c1'], ascending = False)[['c0','c1','c2','c3','c4']]

    c0  c1  c2  c3  c4
r0  10  20  30  40  50
r2   3   6   9  12  15
r1   1  45  80  70  60